PFA Complete logs:

2021/02/24 22:45:32 [INFO] backend/local: starting Plan operation
2021-02-24T22:45:32.143+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.178+0530 [INFO]  plugin.terraform-provider-random_v3.1.0_x5: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.177+0530
2021-02-24T22:45:32.268+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-24T22:45:32.269+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.302+0530 [INFO]  plugin.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.302+0530
2021-02-24T22:45:32.385+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2021-02-24T22:45:32.386+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.457+0530 [INFO]  plugin.terraform-provider-ibm_v1.16.1: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.457+0530
2021-02-24T22:45:32.564+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/02/24 22:45:32 [INFO] terraform: building graph: GraphTypeValidate
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "path.module"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:32 [WARN] ReferenceTransformer: reference not found: "count.index"
2021-02-24T22:45:32.582+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.617+0530 [INFO]  plugin.terraform-provider-random_v3.1.0_x5: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.616+0530
2021-02-24T22:45:32.700+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.732+0530 [INFO]  plugin.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.732+0530
2021-02-24T22:45:32.814+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:32.814+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2021-02-24T22:45:32.890+0530 [INFO]  plugin.terraform-provider-ibm_v1.16.1: configuring server automatic mTLS: timestamp=2021-02-24T22:45:32.890+0530
2021-02-24T22:45:33.027+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021-02-24T22:45:33.034+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/02/24 22:45:33 [INFO] backend/local: plan calling Refresh
2021/02/24 22:45:33 [INFO] terraform: building graph: GraphTypeRefresh
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:45:33 [WARN] ReferenceTransformer: reference not found: "path.module"
2021-02-24T22:45:33.058+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:33.091+0530 [INFO]  plugin.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2021-02-24T22:45:33.090+0530
2021-02-24T22:45:33.170+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:33.171+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2021-02-24T22:45:33.204+0530 [INFO]  plugin.terraform-provider-random_v3.1.0_x5: configuring server automatic mTLS: timestamp=2021-02-24T22:45:33.203+0530
2021-02-24T22:45:33.288+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:45:33.357+0530 [INFO]  plugin.terraform-provider-ibm_v1.16.1: configuring server automatic mTLS: timestamp=2021-02-24T22:45:33.356+0530
2021/02/24 22:45:39 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
module.bx-vpc.data.ibm_is_zones.ds_zones: Refreshing state... [id=2021-02-24 17:04:08.061457 +0000 UTC]
module.bx-vpc.ibm_resource_group.rg: Refreshing state... [id=6738b23ab80c48bb9dec551aa2b6a550]
module.bx-vpc.ibm_is_vpc.vpc: Refreshing state... [id=r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97]
module.bx-vpc.ibm_is_public_gateway.pub_gw[2]: Refreshing state... [id=r006-938e07a4-8f42-436a-b205-48e7df022149]
module.bx-vpc.ibm_is_public_gateway.pub_gw[0]: Refreshing state... [id=r006-6ad263f3-4f44-4fb2-bd22-a53f8e255c77]
module.bx-vpc.ibm_is_security_group_rule.sg_rule_80_out: Refreshing state... [id=r006-28f9c9fc-f60f-4989-8ad4-7b2ae73e2d75.r006-99be2318-e0d4-4dc6-80f6-74dda4d2b3b6]
module.bx-vpc.ibm_is_vpc_address_prefix.address_prefix[2]: Refreshing state... [id=r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97/r006-597aeca1-5a41-4cec-9293-8775ab0b5351]
module.bx-vpc.ibm_is_security_group_rule.sg_rule_ssh: Refreshing state... [id=r006-28f9c9fc-f60f-4989-8ad4-7b2ae73e2d75.r006-0246fdfc-83a7-4b15-8de2-eb24a78bfdc4]
module.bx-vpc.ibm_is_vpc_address_prefix.address_prefix[0]: Refreshing state... [id=r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97/r006-334443dd-e12d-4534-925d-cceb0c2d2b0d]
module.bx-vpc.ibm_is_vpc_address_prefix.address_prefix[1]: Refreshing state... [id=r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97/r006-e3bb1e1e-50cd-43c3-96b9-7250d66a9ddb]
module.bx-vpc.ibm_is_public_gateway.pub_gw[1]: Refreshing state... [id=r006-138f31ca-cba7-4794-bf35-ed0e86cdfd89]
module.bx-vpc.ibm_is_subnet.test_subnet[0]: Refreshing state... [id=0717-4a0342b3-2eb5-43c8-a5c2-b0bd619b1c73]
module.bx-vpc.ibm_is_subnet.test_subnet[2]: Refreshing state... [id=0737-bb30414f-fe7a-4589-9f5f-a1e51cb3935a]
module.bx-vpc.ibm_is_subnet.test_subnet[1]: Refreshing state... [id=0727-95ba021a-d0d6-4426-bd70-da4b0a274abc]
module.bx-vpc.ibm_is_network_acl.vpnacl_frontend: Refreshing state... [id=r006-8a7d17d9-8fd6-4cdc-8676-cd5090b04b1a]
module.bx-vpc.ibm_is_subnet_network_acl_attachment.attach_frontend[1]: Refreshing state... [id=0727-95ba021a-d0d6-4426-bd70-da4b0a274abc]
module.bx-vpc.ibm_is_subnet_network_acl_attachment.attach_frontend[0]: Refreshing state... [id=0717-4a0342b3-2eb5-43c8-a5c2-b0bd619b1c73]
module.bx-vpc.ibm_is_subnet_network_acl_attachment.attach_frontend[2]: Refreshing state... [id=0737-bb30414f-fe7a-4589-9f5f-a1e51cb3935a]
2021/02/24 22:45:53 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
module.vm-on-vpc.random_string.randomId[0]: Refreshing state... [id=7b6epm5q8geri95mawgj]
module.vm-on-vpc.data.ibm_is_zones.ds_zones: Refreshing state... [id=2021-02-24 17:06:13.5667618 +0000 UTC]
module.vm-on-vpc.data.ibm_resource_group.rg: Refreshing state... [id=6738b23ab80c48bb9dec551aa2b6a550]
2021/02/24 22:45:53 [WARN] ReferenceTransformer: reference not found: "path.module"
2021/02/24 22:45:53 [WARN] ReferenceTransformer: reference not found: "var.vpc_name"
module.vm-on-vpc.data.template_file.user_data_with_blockstorage[0]: Refreshing state... [id=c72b642b8c271fdab9dc5c13aa7dfdd2db44a38c023b304293a39c51c1bb8620]
module.vm-on-vpc.data.ibm_is_image.ubuntu: Refreshing state... [id=r006-ed3f775f-ad7e-4e37-ae62-7199b4988b00]
2021-02-24T22:45:53.713+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
module.vm-on-vpc.data.ibm_is_vpc.ds_vpc: Refreshing state... [id=r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97]
module.vm-on-vpc.data.ibm_is_ssh_key.existing_ssh_key: Refreshing state... [id=r006-64a91f52-7d9e-49f1-8b5e-cbe822b59aa0]
2021/02/24 22:45:54 [WARN] ReferenceTransformer: reference not found: "local.no_of_zones"
2021/02/24 22:45:54 [WARN] ReferenceTransformer: reference not found: "count.index"
module.vm-on-vpc.data.ibm_is_subnet.test_subnet[0]: Refreshing state... [id=0717-4a0342b3-2eb5-43c8-a5c2-b0bd619b1c73]
module.vm-on-vpc.ibm_is_volume.volume[0]: Refreshing state... [id=r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52]
module.vm-on-vpc.ibm_is_instance.vm[0]: Refreshing state... [id=0717_bf3f5950-c862-479c-aba5-f6b9b36a6b9c]
2021-02-24T22:46:00.097+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/02/24 22:46:00 [INFO] backend/local: plan calling Plan
2021/02/24 22:46:00 [INFO] terraform: building graph: GraphTypePlan

------------------------------------------------------------------------
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "path.module"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:00 [WARN] ReferenceTransformer: reference not found: "count.index"
2021-02-24T22:46:00.123+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:46:00.156+0530 [INFO]  plugin.terraform-provider-template_v2.2.0_x4: configuring server automatic mTLS: timestamp=2021-02-24T22:46:00.156+0530
2021-02-24T22:46:00.240+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:46:00.241+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unimplemented desc = unknown service plugin.GRPCStdio"
2021-02-24T22:46:00.308+0530 [INFO]  plugin.terraform-provider-ibm_v1.16.1: configuring server automatic mTLS: timestamp=2021-02-24T22:46:00.308+0530
2021-02-24T22:46:00.383+0530 [INFO]  plugin: configuring client automatic mTLS
2021-02-24T22:46:00.415+0530 [INFO]  plugin.terraform-provider-random_v3.1.0_x5: configuring server automatic mTLS: timestamp=2021-02-24T22:46:00.415+0530
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.ibm_tags"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.regionname"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_env"
2021/02/24 22:46:03 [WARN] Provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid plan for module.bx-vpc.ibm_is_vpc.vpc, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation"), cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("createdon:24-02-2021"), cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation")})
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.unique_id"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.unique_id"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.unique_id"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.regionname"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_env"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_public_gateway.pub_gw"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_public_gateway.pub_gw"
4 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_public_gateway.pub_gw"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_vpc_address_prefix.address_prefix"
: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_public_gateway.pub_gw"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.vpc_name"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.no_of_vm"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "path.module"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_region"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.no_of_zones"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.ibm_tags"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.regionname"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.unique_id"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_env"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021-02-24T22:46:03.912+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/02/24 22:46:03 [WARN] Provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid plan for module.vm-on-vpc.ibm_is_volume.volume[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation"), cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("createdon:24-02-2021"), cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation")})
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.no_of_vm"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "data.template_file.user_data_with_blockstorage"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.regionname"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.unique_id"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_env"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "local.ibm_tags"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "var.ibm_machine_type"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "ibm_is_volume.volume"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "data.ibm_is_subnet.test_subnet"
2021/02/24 22:46:03 [WARN] ReferenceTransformer: reference not found: "count.index"
2021/02/24 22:46:03 [WARN] Provider "registry.terraform.io/ibm-cloud/ibm" produced an invalid plan for module.vm-on-vpc.ibm_is_instance.vm[0], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .volumes: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52")})
      - .tags: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation"), cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("createdon:24-02-2021"), cty.StringVal("env:test"), cty.StringVal("project:test"), cty.StringVal("triggeredby:automation")})
      - .boot_volume: block count in plan (1) disagrees with count in config (0)
      - .primary_network_interface[0].security_groups: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetVal([]cty.Value{cty.StringVal("r006-28f9c9fc-f60f-4989-8ad4-7b2ae73e2d75")})
2021-02-24T22:46:03.933+0530 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2021/02/24 22:46:03 [INFO] backend/local: plan operation completed
2021/02/24 22:46:03 [INFO] backend/local: writing plan output to: test



  **# module.vm-on-vpc.ibm_is_instance.vm[0] must be replaced**
```
-/+ resource "ibm_is_instance" "vm" {
      ~ gpu                     = [] -> (known after apply)
      ~ id                      = "0717_bf3f5950-c862-479c-aba5-f6b9b36a6b9c" -> (known after apply)
      ~ image                   = "r006-ed3f775f-ad7e-4e37-ae62-7199b4988b00" -> (known after apply)
      ~ keys                    = [
          - "r006-64a91f52-7d9e-49f1-8b5e-cbe822b59aa0",
        ] -> (known after apply)
      ~ memory                  = 8 -> (known after apply)
        name                    = "vm-test-1000-1"
        profile                 = "bx2-2x8"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/compute/vs" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::instance:0717_bf3f5950-c862-479c-aba5-f6b9b36a6b9c" -> (known after apply)
      ~ resource_group          = "04db140398064264a81ef91ad0853c50" -> (known after apply)
      ~ resource_group_name     = "Default" -> (known after apply)
      ~ resource_name           = "vm-test-1000-1" -> (known after apply)
      ~ resource_status         = "running" -> (known after apply)
      ~ status                  = "running" -> (known after apply)
      ~ tags                    = [
          - "env:test",
        ] -> (known after apply)
      ~ vcpu                    = [
          - {
              - architecture = "amd64"
              - count        = 2
            },
        ] -> (known after apply)
      ~ volume_attachments      = [
          - {
              - id          = "0717-d57b04ba-2bdd-4975-af04-d1f62b08c3b2"
              - name        = "volume-attachment"
              - volume_crn  = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::volume:r006-5adbc945-0dbf-459e-b808-84f1f6e235ac"
              - volume_id   = "r006-5adbc945-0dbf-459e-b808-84f1f6e235ac"
              - volume_name = "woken-unpaid-replace-stumble"
            },
          - {
              - id          = "0717-93a0e468-003a-408a-8eb6-a356b7045e9c"
              - name        = "volume-attachment"
              - volume_crn  = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::volume:r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52"
              - volume_id   = "r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52"
              - volume_name = "vm-test-1000-1"
            },
        ] -> (known after apply)
      ~ volumes                 = [
          - "r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52",
        ] -> (known after apply)
      ~ vpc                     = "r006-ec7d34c8-b11e-4ec0-8037-78a49a70fb97" -> (known after apply) # forces replacement
      ~ zone                    = "us-south-1" -> (known after apply) # forces replacement

      ~ boot_volume {
          ~ encryption = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::volume:r006-5adbc945-0dbf-459e-b808-84f1f6e235ac" -> (known after apply)
          ~ iops       = 0 -> (known after apply)
          ~ name       = "volume-attachment" -> (known after apply)
          + profile    = (known after apply)
          ~ size       = 0 -> (known after apply)
        }

      ~ primary_network_interface {
            allow_ip_spoofing    = false
          ~ id                   = "0717-7115e790-c205-4ac6-bf9f-1647b0e279d1" -> (known after apply)
          ~ name                 = "sandstorm-suspense-slather-deprive" -> (known after apply)
          - port_speed           = 0 -> null
          ~ primary_ipv4_address = "10.20.0.20" -> (known after apply)
          ~ security_groups      = [
              - "r006-28f9c9fc-f60f-4989-8ad4-7b2ae73e2d75",
            ] -> (known after apply)
          ~ subnet               = "0717-4a0342b3-2eb5-43c8-a5c2-b0bd619b1c73" -> (known after apply) # forces replacement
        }
    }
# module.vm-on-vpc.ibm_is_volume.volume[0] must be replaced

-/+ resource "ibm_is_volume" "volume" {
        capacity                = 50
      ~ crn                     = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::volume:r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52" -> (known after apply)
      + encryption_key          = (known after apply)
      ~ id                      = "r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52" -> (known after apply)
        iops                    = 100
        name                    = "vm-test-1000-1"
        profile                 = "custom"
      ~ resource_controller_url = "https://cloud.ibm.com/vpc-ext/storage/storageVolumes" -> (known after apply)
      ~ resource_crn            = "crn:v1:bluemix:public:is:us-south-1:a/931c0567c7d349a987f8b1bd5deb7178::volume:r006-a456e4e9-cf83-4e0e-bfdd-1780c4fafc52" -> (known after apply)
      ~ resource_group          = "04db140398064264a81ef91ad0853c50" -> (known after apply)
      ~ resource_group_name     = "Default" -> (known after apply)
      ~ resource_name           = "vm-test-1000-1" -> (known after apply)
      ~ resource_status         = "available" -> (known after apply)
      ~ status                  = "available" -> (known after apply)
      ~ tags                    = [
          - "env:test",
        ] -> (known after apply)
      ~ zone                    = "us-south-1" -> (known after apply) # forces replacement
    }

Plan: 2 to add, 2 to change, 2 to destroy. 
```